Revit 2027 API
MultistoryStairs.IsPinned Method
 Checks if a stair is pinned.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPinned(
	Stairs stairs
)
Public Function IsPinned (
	stairs As Stairs
) As Boolean
public:
bool IsPinned(
	Stairs^ stairs
)
member IsPinned :
        stairs : Stairs -> bool
Parameters
stairs Stairs
 A stairs element in this multistory stairs element.
Return Value
Boolean
 Returns true if the stairs is pinned; otherwise returns false.
Exceptions
Exception | Condition
ArgumentException |  The input stairs is not a member of this multistory stairs.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MultistoryStairs Class
Autodesk.Revit.DB.Architecture Namespace